# Pandas

This notebook is based on the following sources:
* information from the Harvard CS109 course http://cs109.github.io/2015/pages/videos.html
* pandas cheat sheet by Mark Graph https://drive.google.com/folderview?id=0ByIrJAE4KMTtaGhRcXkxNHhmY2M
* Python for Data Analysis book http://shop.oreilly.com/product/0636920023784.do

In [3]:
import pandas as pd  #note the name convention

## Data Frame
DataFrame is a 2-D table with row Index and column Index. Columns are made up of pandas Series objects
read_csv gives back a DataFrame.

In [4]:

col_names = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', 
    names=col_names)

print ("Column index:" )
print (users.columns) # columns of the DataFrame is a member of the DataFrame object which contains the Index
print ("Row index:") 
print (users.index) #

Column index:
Index(['user_id', 'age', 'sex', 'occupation', 'zip_code'], dtype='object')
Row index:
Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            933, 934, 935, 936, 937, 938, 939, 940, 941, 942],
           dtype='int64', length=943)

## Series object
an ordered, one dimensional array-like object.Contains an array of data, and an array of labels, called Index. The string representation show index on the left and values on the right. You can also thin of Series as an ordered dictionary.

In [5]:
s1 = pd.Series([4,5,6,7])
s1

0    4
1    5
2    6
3    7
dtype: int64

In [7]:
s1.values # access the data of the series

array([4, 5, 6, 7], dtype=int64)

In [88]:
s1.index # access the index of the Series

Int64Index([0, 1, 2, 3], dtype='int64')

In [9]:
s2=pd.Series([3,2,1], index = ['c','b','a'])
s2

c    3
b    2
a    1
dtype: int64

In [10]:
s3 = pd.Series({'a':22, 'd':77})
s3

a    22
d    77
dtype: int64

In [12]:
s3.isnull() # a method to detect missing data

a    False
d    False
dtype: bool

In [13]:
s2 + s3# automatic alignment of differently indexed data

a    23
b   NaN
c   NaN
d   NaN
dtype: float64

## Index object
The Index object provides the axis labels for the Series objects and DataFrame objects.

## Construct DataFrame by reading the data

### Reading data from the WEB

### Reading data from CSV file

### Reading data from inline CSV

* you can specify separator within the data
* you can specify column names

In [92]:
# the data from movielens does not contain column names, so we have to pass in column names explicitly, 
# --> "names" parameter
# moreover, the columns are separated with '|'
# --> "sep" parameter
col_names = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', 
    names=col_names)

users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

### you can specify subset of the columns to be read

In [93]:
# read a subset of the data by specifing the indices of the columns to be read
sub_col_names = ['user_id', 'age', 'occupation']

usersSub= pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', 
    names=sub_col_names,
    usecols=[1, 2, 4])

usersSub.head()

   user_id age occupation
0       24   M      85711
1       53   F      94043
2       23   M      32067
3       24   M      43537
4       33   F      15213

In [94]:
# read a subset of the data by using range
users3col= pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.user', 
    sep='|', 
    names=col_names[:3], # col names 0, 1, 2
    usecols=range(0,3)) # same as [0,1,2]
users3col.head()

   user_id  age sex
0        1   24   M
1        2   53   F
2        3   23   M
3        4   24   M
4        5   33   F

In [95]:
users.index # index is another member of the DataFrame object

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            933, 934, 935, 936, 937, 938, 939, 940, 941, 942],
           dtype='int64', length=943)

### Basic information about DataFrame

In [108]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
sex           943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 44.2+ KB

In [96]:
users.describe() # basic statistics of the data: count, mean, min, max, std

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [97]:
users.head(2)

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043

In [107]:
users.tail(3)

     user_id  age sex occupation zip_code
940      941   20   M    student    97229
941      942   48   F  librarian    78209
942      943   22   M    student    77841

## Filtering of the data

In [98]:
tmp = users[users.age < 30] # syntax with .
tmp.head(2)

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
2        3   23   M      writer    32067

In [99]:
tmp = users[users['age']< 30] #syntax with []
tmp.head(2)

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
2        3   23   M      writer    32067

In [100]:
users[(users.occupation == 'writer') & (users.sex == 'F')].head(3) # combining with bitwise operators: & | ^ ~

     user_id  age sex occupation zip_code
121      122   32   F     writer    22206
235      236   44   F     writer    53214
263      264   36   F     writer    90064

In [101]:
users[(users.occupation == 'writer') | (users.sex == 'F')].head(10) # writers or females

    user_id  age sex occupation zip_code
1         2   53   F      other    94043
2         3   23   M     writer    32067
4         5   33   F      other    15213
10       11   39   F      other    30329
11       12   28   F      other    06405
14       15   49   F   educator    97301
17       18   35   F      other    37212
19       20   42   F  homemaker    95660
20       21   26   M     writer    30068
21       22   25   M     writer    40206

In [102]:
users[(users.occupation == 'educator') ^ (users.sex == 'F')].head(3) # educators or females, but not all

    user_id  age sex occupation zip_code
1         2   53   F      other    94043
4         5   33   F      other    15213
10       11   39   F      other    30329

In [103]:
users[users.occupation != 'other'].count()

user_id       838
age           838
sex           838
occupation    838
zip_code      838
dtype: int64

In [104]:
users[~(users.occupation == 'other')].count()

user_id       838
age           838
sex           838
occupation    838
zip_code      838
dtype: int64

## Grouping of the data

In [105]:
grouped = users.groupby('sex')
grouped.count()

     user_id  age  occupation  zip_code
sex
F        273  273         273       273
M        670  670         670       670

## Filling of  unavailable values

In [106]:
tmp = users['age'].fillna(0)